// 215. 数组中的第K个最大元素
// 中等
// 2.4K
// 相关企业

// 给定整数数组 nums 和整数 k，请返回数组中第 k 个最大的元素。

// 请注意，你需要找的是数组排序后的第 k 个最大的元素，而不是第 k 个不同的元素。

// 你必须设计并实现时间复杂度为 O(n) 的算法解决此问题。

 

// 示例 1:

// 输入: [3,2,1,5,6,4], k = 2
// 输出: 5

// 示例 2:

// 输入: [3,2,3,1,2,4,5,5,6], k = 4
// 输出: 4

// 1.我的核心竞争力是持续的自我迭代能力，会从过往的经验中总结复盘和优化，明确自身的优势和短板，加强自身的优势，通过刻意练习来补齐短板，不断加强自身的能力。
// 2.第二个是责任心强，交给我的项目都能够完成闭环，在项目前制定方案，在项目中针对关键节点、成果或问题进行主动反馈和协商解决，全方面的负责项目以致于达到交付标准。
// 3.第三点是主观能动性强，不局限于完成任务本身，会思考怎么样能使产品更完善、用户体验更好，在过往落地的很多项目中，我都参与到了需求的定制和完善中。因此我也拥有一定的产品需求设计能力和UI设计能力

// 提示：

//     1 <= k <= nums.length <= 105
//     -104 <= nums[i] <= 104

/**
 * @param {number[]} nums
 * @param {number} k
 * @return {number}
 */
var findKthLargest = function(nums, k) {

};

